{
  "keras_version": "2.1.6",
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Conv2D",
      "config": {
        "use_bias": true,
        "kernel_regularizer": null,
        "strides": [
          1,
          1
        ],
        "activation": "linear",
        "kernel_size": [
          5,
          5
        ],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "trainable": true,
        "kernel_constraint": null,
        "bias_constraint": null,
        "name": "conv2d_1",
        "bias_regularizer": null,
        "dilation_rate": [
          1,
          1
        ],
        "dtype": "float32",
        "data_format": "channels_first",
        "filters": 20,
        "activity_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "batch_input_shape": [
          null,
          1,
          28,
          28
        ],
        "padding": "same"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_1"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "strides": [
          2,
          2
        ],
        "data_format": "channels_first",
        "trainable": true,
        "name": "max_pooling2d_1",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "use_bias": true,
        "kernel_regularizer": null,
        "strides": [
          1,
          1
        ],
        "activation": "linear",
        "kernel_size": [
          5,
          5
        ],
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "trainable": true,
        "kernel_constraint": null,
        "bias_constraint": null,
        "name": "conv2d_2",
        "bias_regularizer": null,
        "dilation_rate": [
          1,
          1
        ],
        "data_format": "channels_first",
        "filters": 50,
        "activity_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "padding": "same"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_2"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "strides": [
          2,
          2
        ],
        "data_format": "channels_first",
        "trainable": true,
        "name": "max_pooling2d_2",
        "pool_size": [
          2,
          2
        ],
        "padding": "valid"
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "data_format": "channels_last",
        "name": "flatten_1"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_regularizer": null,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "trainable": true,
        "kernel_constraint": null,
        "bias_constraint": null,
        "name": "dense_1",
        "bias_regularizer": null,
        "units": 500,
        "activity_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "relu",
        "name": "activation_3"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_regularizer": null,
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "trainable": true,
        "kernel_constraint": null,
        "bias_constraint": null,
        "name": "dense_2",
        "bias_regularizer": null,
        "units": 10,
        "activity_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "trainable": true,
        "activation": "softmax",
        "name": "activation_4"
      }
    }
  ],
  "backend": "tensorflow"
}